zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/DSC/MC56F83xxx/periph/PERI_SIM.h
/*
** ###################################################################
**     Processors:          MC56F83663VLH
**                          MC56F83683VLH
**                          MC56F83686VLK
**                          MC56F83689VLL
**                          MC56F83763AVLH
**                          MC56F83763VLH
**                          MC56F83766VLK
**                          MC56F83769AVLL
**                          MC56F83769VLL
**                          MC56F83783AVLH
**                          MC56F83783VLH
**                          MC56F83786VLK
**                          MC56F83789AVLL
**                          MC56F83789VLL
**
**     Version:             rev. 1.0, 2024-10-29
**     Build:               b250520
**
**     Abstract:
**         CMSIS Peripheral Access Layer for SIM
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2025 NXP
**     SPDX-License-Identifier: BSD-3-Clause
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
**     Revisions:
**     - rev. 0.1 (2019-09-23)
**         Initial version.
**     - rev. 1.0 (2024-10-29)
**         Change the device header file from single flat file to multiple files based on peripherals,
**         each peripheral with dedicated header file located in periphN folder.
**
** ###################################################################
*/

/*!
 * @file PERI_SIM.h
 * @version 1.0
 * @date 2024-10-29
 * @brief CMSIS Peripheral Access Layer for SIM
 *
 * CMSIS Peripheral Access Layer for SIM
 */

#if !defined(PERI_SIM_H_)
#define PERI_SIM_H_                              /**< Symbol preventing repeated inclusion */

#if (defined(CPU_MC56F83663VLH))
#include "MC56F83663_COMMON.h"
#elif (defined(CPU_MC56F83683VLH))
#include "MC56F83683_COMMON.h"
#elif (defined(CPU_MC56F83686VLK))
#include "MC56F83686_COMMON.h"
#elif (defined(CPU_MC56F83689VLL))
#include "MC56F83689_COMMON.h"
#elif (defined(CPU_MC56F83763AVLH) || defined(CPU_MC56F83763VLH))
#include "MC56F83763_COMMON.h"
#elif (defined(CPU_MC56F83766VLK))
#include "MC56F83766_COMMON.h"
#elif (defined(CPU_MC56F83769AVLL) || defined(CPU_MC56F83769VLL))
#include "MC56F83769_COMMON.h"
#elif (defined(CPU_MC56F83783AVLH) || defined(CPU_MC56F83783VLH))
#include "MC56F83783_COMMON.h"
#elif (defined(CPU_MC56F83786VLK))
#include "MC56F83786_COMMON.h"
#elif (defined(CPU_MC56F83789AVLL) || defined(CPU_MC56F83789VLL))
#include "MC56F83789_COMMON.h"
#else
  #error "No valid CPU defined!"
#endif

/* ----------------------------------------------------------------------------
   -- Mapping Information
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Mapping_Information Mapping Information
 * @{
 */

/** Mapping Information */
#if !defined(GPIO_PERIPHERAL_MUX_T_)
#define GPIO_PERIPHERAL_MUX_T_
/*!
 * @addtogroup Pin_Mux
 * @{
 */

/*!
 * @brief Structure for the pin mux table
 *
 * The pin mux table is soc specificed.
 * Enumeration member bitfield:
 *   BIT0~BIT1: peripheral function selector.
 *   BIT4~BIT7: pin index.
 *   BIT8~BIT11: port index.
 *   Other BITs: 0, reserved.
 */
typedef enum _gpio_peripheral_mux
{
    kGPIO_Peri_A0_ANA0_and_CMPA_IN3 = 0x0000,      /**< GPIO_A0, Pin */
    kGPIO_Peri_A0_CMPC_O            = 0x0001,      /**< GPIO_A0, Pin */
    kGPIO_Peri_C0_EXTAL             = 0x0200,      /**< GPIO_C0, Pin */
    kGPIO_Peri_C0_CLKIN0            = 0x0201,      /**< GPIO_C0, Pin */
    kGPIO_Peri_C2_TXD0              = 0x0220,      /**< GPIO_C2, Pin */
    kGPIO_Peri_C2_TB0               = 0x0221,      /**< GPIO_C2, Pin */
    kGPIO_Peri_C2_XB_IN2            = 0x0222,      /**< GPIO_C2, Pin */
    kGPIO_Peri_C2_CLKO0             = 0x0223,      /**< GPIO_C2, Pin */
    kGPIO_Peri_C3_TA0               = 0x0230,      /**< GPIO_C3, Pin */
    kGPIO_Peri_C3_CMPA_O            = 0x0231,      /**< GPIO_C3, Pin */
    kGPIO_Peri_C3_RXD0              = 0x0232,      /**< GPIO_C3, Pin */
    kGPIO_Peri_C3_CLKIN1            = 0x0233,      /**< GPIO_C3, Pin */
    kGPIO_Peri_C4_TA1               = 0x0240,      /**< GPIO_C4, Pin */
    kGPIO_Peri_C4_CMPB_O            = 0x0241,      /**< GPIO_C4, Pin */
    kGPIO_Peri_C4_XB_IN8            = 0x0242,      /**< GPIO_C4, Pin */
    kGPIO_Peri_C4_EWM_OUT_B         = 0x0243,      /**< GPIO_C4, Pin */
    kGPIO_Peri_C5_XB_IN7            = 0x0251,      /**< GPIO_C5, Pin */
    kGPIO_Peri_C6_TA2               = 0x0260,      /**< GPIO_C6, Pin */
    kGPIO_Peri_C6_XB_IN3            = 0x0261,      /**< GPIO_C6, Pin */
    kGPIO_Peri_C6_CMP_REF           = 0x0262,      /**< GPIO_C6, Pin */
    kGPIO_Peri_C6_SS0_B             = 0x0263,      /**< GPIO_C6, Pin */
    kGPIO_Peri_C7_SS0_B             = 0x0270,      /**< GPIO_C7, Pin */
    kGPIO_Peri_C7_TXD0              = 0x0271,      /**< GPIO_C7, Pin */
    kGPIO_Peri_C7_XB_IN8            = 0x0272,      /**< GPIO_C7, Pin */
    kGPIO_Peri_C7_XB_OUT6           = 0x0273,      /**< GPIO_C7, Pin */
    kGPIO_Peri_C8_MISO0             = 0x0280,      /**< GPIO_C8, Pin */
    kGPIO_Peri_C8_RXD0              = 0x0281,      /**< GPIO_C8, Pin */
    kGPIO_Peri_C8_XB_IN9            = 0x0282,      /**< GPIO_C8, Pin */
    kGPIO_Peri_C9_SCLK0             = 0x0290,      /**< GPIO_C9, Pin */
    kGPIO_Peri_C9_XB_IN4            = 0x0291,      /**< GPIO_C9, Pin */
    kGPIO_Peri_C9_TXD0              = 0x0292,      /**< GPIO_C9, Pin */
    kGPIO_Peri_C9_XB_OUT8           = 0x0293,      /**< GPIO_C9, Pin */
    kGPIO_Peri_C10_MOSI0            = 0x02A0,      /**< GPIO_C10, Pin */
    kGPIO_Peri_C10_XB_IN5           = 0x02A1,      /**< GPIO_C10, Pin */
    kGPIO_Peri_C10_MISO0            = 0x02A2,      /**< GPIO_C10, Pin */
    kGPIO_Peri_C10_XB_OUT9          = 0x02A3,      /**< GPIO_C10, Pin */
    kGPIO_Peri_C11_CANTX            = 0x02B0,      /**< GPIO_C11, Pin */
    kGPIO_Peri_C11_SCL1             = 0x02B1,      /**< GPIO_C11, Pin */
    kGPIO_Peri_C11_TXD1             = 0x02B2,      /**< GPIO_C11, Pin */
    kGPIO_Peri_C12_CANRX            = 0x02C0,      /**< GPIO_C12, Pin */
    kGPIO_Peri_C12_SDA1             = 0x02C1,      /**< GPIO_C12, Pin */
    kGPIO_Peri_C12_RXD1             = 0x02C2,      /**< GPIO_C12, Pin */
    kGPIO_Peri_C13_TA3              = 0x02D0,      /**< GPIO_C13, Pin */
    kGPIO_Peri_C13_XB_IN6           = 0x02D1,      /**< GPIO_C13, Pin */
    kGPIO_Peri_C13_EWM_OUT_B        = 0x02D2,      /**< GPIO_C13, Pin */
    kGPIO_Peri_C14_SDA0             = 0x02E0,      /**< GPIO_C14, Pin */
    kGPIO_Peri_C14_XB_OUT4          = 0x02E1,      /**< GPIO_C14, Pin */
    kGPIO_Peri_C14_PWMA_FAULT4      = 0x02E2,      /**< GPIO_C14, Pin */
    kGPIO_Peri_C15_SCL0             = 0x02F0,      /**< GPIO_C15, Pin */
    kGPIO_Peri_C15_XB_OUT5          = 0x02F1,      /**< GPIO_C15, Pin */
    kGPIO_Peri_C15_PWMA_FAULT5      = 0x02F2,      /**< GPIO_C15, Pin */
    kGPIO_Peri_E0_PWMA_0B           = 0x0400,      /**< GPIO_E0, Pin */
    kGPIO_Peri_E0_XB_OUT4           = 0x0403,      /**< GPIO_E0, Pin */
    kGPIO_Peri_E1_PWMA_0A           = 0x0410,      /**< GPIO_E1, Pin */
    kGPIO_Peri_E1_XB_OUT5           = 0x0413,      /**< GPIO_E1, Pin */
    kGPIO_Peri_E2_PWMA_1B           = 0x0420,      /**< GPIO_E2, Pin */
    kGPIO_Peri_E2_XB_OUT6           = 0x0423,      /**< GPIO_E2, Pin */
    kGPIO_Peri_E3_PWMA_1A           = 0x0430,      /**< GPIO_E3, Pin */
    kGPIO_Peri_E3_XB_OUT7           = 0x0433,      /**< GPIO_E3, Pin */
    kGPIO_Peri_E4_PWMA_2B           = 0x0440,      /**< GPIO_E4, Pin */
    kGPIO_Peri_E4_XB_IN2            = 0x0441,      /**< GPIO_E4, Pin */
    kGPIO_Peri_E4_XB_OUT8           = 0x0443,      /**< GPIO_E4, Pin */
    kGPIO_Peri_E5_PWMA_2A           = 0x0450,      /**< GPIO_E5, Pin */
    kGPIO_Peri_E5_XB_IN3            = 0x0451,      /**< GPIO_E5, Pin */
    kGPIO_Peri_E5_XB_OUT9           = 0x0453,      /**< GPIO_E5, Pin */
    kGPIO_Peri_E6_PWMA_3B           = 0x0460,      /**< GPIO_E6, Pin */
    kGPIO_Peri_E6_XB_IN4            = 0x0461,      /**< GPIO_E6, Pin */
    kGPIO_Peri_E6_PWMB_2B           = 0x0462,      /**< GPIO_E6, Pin */
    kGPIO_Peri_E6_XB_OUT10          = 0x0463,      /**< GPIO_E6, Pin */
    kGPIO_Peri_E7_PWMA_3A           = 0x0470,      /**< GPIO_E7, Pin */
    kGPIO_Peri_E7_XB_IN5            = 0x0471,      /**< GPIO_E7, Pin */
    kGPIO_Peri_E7_PWMB_2A           = 0x0472,      /**< GPIO_E7, Pin */
    kGPIO_Peri_E7_XB_OUT11          = 0x0473,      /**< GPIO_E7, Pin */
    kGPIO_Peri_F0_XB_IN6            = 0x0500,      /**< GPIO_F0, Pin */
    kGPIO_Peri_F0_TB2               = 0x0501,      /**< GPIO_F0, Pin */
    kGPIO_Peri_F1_CLKO1             = 0x0510,      /**< GPIO_F1, Pin */
    kGPIO_Peri_F1_XB_IN7            = 0x0511,      /**< GPIO_F1, Pin */
    kGPIO_Peri_F1_CMPD_O            = 0x0512,      /**< GPIO_F1, Pin */
    kGPIO_Peri_F2_SCL1              = 0x0520,      /**< GPIO_F2, Pin */
    kGPIO_Peri_F2_XB_OUT6           = 0x0521,      /**< GPIO_F2, Pin */
    kGPIO_Peri_F3_SDA1              = 0x0530,      /**< GPIO_F3, Pin */
    kGPIO_Peri_F3_XB_OUT7           = 0x0531,      /**< GPIO_F3, Pin */
    kGPIO_Peri_F4_TXD1              = 0x0540,      /**< GPIO_F4, Pin */
    kGPIO_Peri_F4_XB_OUT8           = 0x0541,      /**< GPIO_F4, Pin */
    kGPIO_Peri_F4_PWMA_0X           = 0x0542,      /**< GPIO_F4, Pin */
    kGPIO_Peri_F4_PWMA_FAULT6       = 0x0543,      /**< GPIO_F4, Pin */
    kGPIO_Peri_F5_RXD1              = 0x0550,      /**< GPIO_F5, Pin */
    kGPIO_Peri_F5_XB_OUT9           = 0x0551,      /**< GPIO_F5, Pin */
    kGPIO_Peri_F5_PWMA_1X           = 0x0552,      /**< GPIO_F5, Pin */
    kGPIO_Peri_F5_PWMA_FAULT7       = 0x0553,      /**< GPIO_F5, Pin */
    kGPIO_Peri_F6_TB2               = 0x0560,      /**< GPIO_F6, Pin */
    kGPIO_Peri_F6_PWMA_3X           = 0x0561,      /**< GPIO_F6, Pin */
    kGPIO_Peri_F6_PWMB_3X           = 0x0562,      /**< GPIO_F6, Pin */
    kGPIO_Peri_F6_XB_IN2            = 0x0563,      /**< GPIO_F6, Pin */
    kGPIO_Peri_F7_TB3               = 0x0570,      /**< GPIO_F7, Pin */
    kGPIO_Peri_F7_CMPC_O            = 0x0571,      /**< GPIO_F7, Pin */
    kGPIO_Peri_F7_XB_IN3            = 0x0573,      /**< GPIO_F7, Pin */
    kGPIO_Peri_F8_RXD0              = 0x0580,      /**< GPIO_F8, Pin */
    kGPIO_Peri_F8_TB1               = 0x0581,      /**< GPIO_F8, Pin */
    kGPIO_Peri_F8_CMPD_O            = 0x0582,      /**< GPIO_F8, Pin */
    kGPIO_Peri_F8_PWMA_2X           = 0x0583,      /**< GPIO_F8, Pin */
    kGPIO_Peri_A11_CMPC_O           = 0x00B0,      /**< GPIO_A11, Pin */
    kGPIO_Peri_A11_XB_IN9           = 0x00B1,      /**< GPIO_A11, Pin */
    kGPIO_Peri_A11_XB_OUT10         = 0x00B2,      /**< GPIO_A11, Pin */
    kGPIO_Peri_B8_CMPD_O            = 0x0180,      /**< GPIO_B8, Pin */
    kGPIO_Peri_B8_XB_IN8            = 0x0181,      /**< GPIO_B8, Pin */
    kGPIO_Peri_B8_XB_OUT11          = 0x0182,      /**< GPIO_B8, Pin */
    kGPIO_Peri_D5_RXD2              = 0x0350,      /**< GPIO_D5, Pin */
    kGPIO_Peri_D5_XB_IN5            = 0x0351,      /**< GPIO_D5, Pin */
    kGPIO_Peri_D5_XB_OUT9           = 0x0352,      /**< GPIO_D5, Pin */
    kGPIO_Peri_D6_TXD2              = 0x0360,      /**< GPIO_D6, Pin */
    kGPIO_Peri_D6_XB_IN4            = 0x0361,      /**< GPIO_D6, Pin */
    kGPIO_Peri_D6_XB_OUT8           = 0x0362,      /**< GPIO_D6, Pin */
    kGPIO_Peri_D7_XB_OUT11          = 0x0370,      /**< GPIO_D7, Pin */
    kGPIO_Peri_D7_XB_IN7            = 0x0371,      /**< GPIO_D7, Pin */
    kGPIO_Peri_D7_MISO1             = 0x0372,      /**< GPIO_D7, Pin */
    kGPIO_Peri_F0_SCLK1             = 0x0502,      /**< GPIO_F0, Pin */
    kGPIO_Peri_F2_MISO1             = 0x0522,      /**< GPIO_F2, Pin */
    kGPIO_Peri_F3_MOSI1             = 0x0532,      /**< GPIO_F3, Pin */
    kGPIO_Peri_F7_SS1_B             = 0x0572,      /**< GPIO_F7, Pin */
    kGPIO_Peri_F9_RXD2              = 0x0590,      /**< GPIO_F9, Pin */
    kGPIO_Peri_F9_PWMA_FAULT7       = 0x0591,      /**< GPIO_F9, Pin */
    kGPIO_Peri_F9_PWMB_FAULT7       = 0x0592,      /**< GPIO_F9, Pin */
    kGPIO_Peri_F9_XB_OUT11          = 0x0593,      /**< GPIO_F9, Pin */
    kGPIO_Peri_F10_TXD2             = 0x05A0,      /**< GPIO_F10, Pin */
    kGPIO_Peri_F10_PWMA_FAULT6      = 0x05A1,      /**< GPIO_F10, Pin */
    kGPIO_Peri_F10_PWMB_FAULT6      = 0x05A2,      /**< GPIO_F10, Pin */
    kGPIO_Peri_F10_XB_OUT10         = 0x05A3,      /**< GPIO_F10, Pin */
    kGPIO_Peri_G0_PWMB_1B           = 0x0600,      /**< GPIO_G0, Pin */
    kGPIO_Peri_G0_XB_OUT6           = 0x0601,      /**< GPIO_G0, Pin */
    kGPIO_Peri_G1_PWMB_1A           = 0x0610,      /**< GPIO_G1, Pin */
    kGPIO_Peri_G1_XB_OUT7           = 0x0611,      /**< GPIO_G1, Pin */
    kGPIO_Peri_G2_PWMB_0B           = 0x0620,      /**< GPIO_G2, Pin */
    kGPIO_Peri_G2_XB_OUT4           = 0x0621,      /**< GPIO_G2, Pin */
    kGPIO_Peri_G3_PWMB_0A           = 0x0630,      /**< GPIO_G3, Pin */
    kGPIO_Peri_G3_XB_OUT5           = 0x0631,      /**< GPIO_G3, Pin */
    kGPIO_Peri_G6_PWMA_FAULT4       = 0x0660,      /**< GPIO_G6, Pin */
    kGPIO_Peri_G6_PWMB_FAULT4       = 0x0661,      /**< GPIO_G6, Pin */
    kGPIO_Peri_G6_TB2               = 0x0662,      /**< GPIO_G6, Pin */
    kGPIO_Peri_G6_XB_OUT8           = 0x0663,      /**< GPIO_G6, Pin */
    kGPIO_Peri_G7_PWMA_FAULT5       = 0x0670,      /**< GPIO_G7, Pin */
    kGPIO_Peri_G7_PWMB_FAULT5       = 0x0671,      /**< GPIO_G7, Pin */
    kGPIO_Peri_G7_XB_OUT9           = 0x0672,      /**< GPIO_G7, Pin */
    kGPIO_Peri_G11_TB3              = 0x06B0,      /**< GPIO_G11, Pin */
    kGPIO_Peri_G11_CLKO0            = 0x06B1,      /**< GPIO_G11, Pin */
    kGPIO_Peri_G11_MOSI1            = 0x06B2,      /**< GPIO_G11, Pin */
    kGPIO_Peri_A11_USB_SOFOUT       = 0x00B3,      /**< GPIO_A11, Pin */
    kGPIO_Peri_E8_PWMB_2B           = 0x0480,      /**< GPIO_E8, Pin */
    kGPIO_Peri_E8_PWMA_FAULT0       = 0x0481,      /**< GPIO_E8, Pin */
    kGPIO_Peri_E8_XB_OUT8           = 0x0483,      /**< GPIO_E8, Pin */
    kGPIO_Peri_E9_PWMB_2A           = 0x0490,      /**< GPIO_E9, Pin */
    kGPIO_Peri_E9_PWMA_FAULT1       = 0x0491,      /**< GPIO_E9, Pin */
    kGPIO_Peri_E9_XB_OUT9           = 0x0493,      /**< GPIO_E9, Pin */
    kGPIO_Peri_F11_TXD0             = 0x05B0,      /**< GPIO_F11, Pin */
    kGPIO_Peri_F11_XB_IN11          = 0x05B1,      /**< GPIO_F11, Pin */
    kGPIO_Peri_F12_MISO1            = 0x05C0,      /**< GPIO_F12, Pin */
    kGPIO_Peri_F12_PWMB_FAULT2      = 0x05C1,      /**< GPIO_F12, Pin */
    kGPIO_Peri_F13_MOSI1            = 0x05D0,      /**< GPIO_F13, Pin */
    kGPIO_Peri_F13_PWMB_FAULT1      = 0x05D1,      /**< GPIO_F13, Pin */
    kGPIO_Peri_F14_SCLK1            = 0x05E0,      /**< GPIO_F14, Pin */
    kGPIO_Peri_F14_PWMB_FAULT0      = 0x05E1,      /**< GPIO_F14, Pin */
    kGPIO_Peri_F15_RXD0             = 0x05F0,      /**< GPIO_F15, Pin */
    kGPIO_Peri_F15_XB_IN10          = 0x05F1,      /**< GPIO_F15, Pin */
    kGPIO_Peri_G4_PWMB_3B           = 0x0640,      /**< GPIO_G4, Pin */
    kGPIO_Peri_G4_PWMA_FAULT2       = 0x0641,      /**< GPIO_G4, Pin */
    kGPIO_Peri_G4_XB_OUT10          = 0x0643,      /**< GPIO_G4, Pin */
    kGPIO_Peri_G5_PWMB_3A           = 0x0650,      /**< GPIO_G5, Pin */
    kGPIO_Peri_G5_PWMA_FAULT3       = 0x0651,      /**< GPIO_G5, Pin */
    kGPIO_Peri_G5_XB_OUT11          = 0x0653,      /**< GPIO_G5, Pin */
    kGPIO_Peri_G7_CLKIN2            = 0x0673,      /**< GPIO_G7, Pin */
    kGPIO_Peri_G8_PWMB_0X           = 0x0680,      /**< GPIO_G8, Pin */
    kGPIO_Peri_G8_PWMA_0X           = 0x0681,      /**< GPIO_G8, Pin */
    kGPIO_Peri_G8_TA2               = 0x0682,      /**< GPIO_G8, Pin */
    kGPIO_Peri_G8_XB_OUT10          = 0x0683,      /**< GPIO_G8, Pin */
    kGPIO_Peri_G9_PWMB_1X           = 0x0690,      /**< GPIO_G9, Pin */
    kGPIO_Peri_G9_PWMA_1X           = 0x0691,      /**< GPIO_G9, Pin */
    kGPIO_Peri_G9_TA3               = 0x0692,      /**< GPIO_G9, Pin */
    kGPIO_Peri_G9_XB_OUT11          = 0x0693,      /**< GPIO_G9, Pin */
    kGPIO_Peri_G10_PWMB_2X          = 0x06A0,      /**< GPIO_G10, Pin */
    kGPIO_Peri_G10_PWMA_2X          = 0x06A1,      /**< GPIO_G10, Pin */
    kGPIO_Peri_G10_XB_IN8           = 0x06A2,      /**< GPIO_G10, Pin */
    kGPIO_Peri_B1_ANB1_and_CMPB_IN0 = 0x0110,      /**< GPIO_B1, Pin */
    kGPIO_Peri_B1_DACB_O            = 0x0111,      /**< GPIO_B1, Pin */
    kGPIO_Peri_C5_DACA_O            = 0x0250,      /**< GPIO_C5, Pin */
} gpio_peripheral_mux_t;

/* @} */
#endif /* GPIO_PERIPHERAL_MUX_T_ */

#if !defined(SIM_XBAR_INPUT_PWM_INDEX_T_)
#define SIM_XBAR_INPUT_PWM_INDEX_T_
typedef enum _sim_xbar_input_pwm_index
{
    kSIM_XBARIN20Index              = 0U,          /**< xbar input 20. */
    kSIM_XBARIN21Index              = 1U,          /**< xbar input 21. */
    kSIM_XBARIN22Index              = 2U,          /**< xbar input 22. */
    kSIM_XBARIN23Index              = 3U,          /**< xbar input 23. */
    kSIM_XBARIN24Index              = 4U,          /**< xbar input 24. */
    kSIM_XBARIN25Index              = 5U,          /**< xbar input 25. */
    kSIM_XBARIN26Index              = 6U,          /**< xbar input 26. */
    kSIM_XBARIN27Index              = 7U,          /**< xbar input 27. */
    kSIM_XBARIN28Index              = 8U,          /**< xbar input 28. */
    kSIM_XBARIN29Index              = 9U,          /**< xbar input 29. */
    kSIM_XBARIN30Index              = 10U,         /**< xbar input 30. */
    kSIM_XBARIN31Index              = 11U,         /**< xbar input 31. */
    kSIM_XBARIN32Index              = 12U,         /**< xbar input 32. */
    kSIM_XBARIN33Index              = 13U,         /**< xbar input 33. */
    kSIM_XBARIN34Index              = 14U,         /**< xbar input 34. */
    kSIM_XBARIN35Index              = 15U,         /**< xbar input 35. */
} sim_xbar_input_pwm_index_t;
#endif /* SIM_XBAR_INPUT_PWM_INDEX_T_ */

#if !defined(SIM_XBAR_INPUT_PWM_SELECTION_T_)
#define SIM_XBAR_INPUT_PWM_SELECTION_T_
typedef enum _sim_xbar_input_pwm_selection
{
    kSIM_XbarIn20PWMA0MuxTrig0      = 0U,          /**< xbar input 20, PWMA0_MUX_TRIG0. */
    kSIM_XbarIn20PWMB0OutTrig0      = 1U,          /**< xbar input 20, PWMB0_OUT_TRIG0. */
    kSIM_XbarIn21PWMA0MuxTrig1      = 0U,          /**< xbar input 21, PWMA0_MUX_TRIG1. */
    kSIM_XbarIn21PWMB0OutTrig1      = 1U,          /**< xbar input 21, PWMB0_OUT_TRIG1. */
    kSIM_XbarIn22PWMA1MuxTrig0      = 0U,          /**< xbar input 22, PWMA1_MUX_TRIG0. */
    kSIM_XbarIn22PWMB1OutTrig0      = 1U,          /**< xbar input 22, PWMB1_OUT_TRIG0. */
    kSIM_XbarIn23PWMA1MuxTrig1      = 0U,          /**< xbar input 23, PWMA1_MUX_TRIG1. */
    kSIM_XbarIn23PWMB1OutTrig1      = 1U,          /**< xbar input 23, PWMB1_OUT_TRIG1. */
    kSIM_XbarIn24PWMA2MuxTrig0      = 0U,          /**< xbar input 24, PWMA2_MUX_TRIG0. */
    kSIM_XbarIn24PWMB2OutTrig0      = 1U,          /**< xbar input 24, PWMB2_OUT_TRIG0. */
    kSIM_XbarIn25PWMA2MuxTrig1      = 0U,          /**< xbar input 25, PWMA2_MUX_TRIG1. */
    kSIM_XbarIn25PWMB2OutTrig1      = 1U,          /**< xbar input 25, PWMB2_OUT_TRIG1. */
    kSIM_XbarIn26PWMA3MuxTrig0      = 0U,          /**< xbar input 26, PWMA3_MUX_TRIG0. */
    kSIM_XbarIn26PWMB3OutTrig0      = 1U,          /**< xbar input 26, PWMB3_OUT_TRIG0. */
    kSIM_XbarIn27PWMA3MuxTrig1      = 0U,          /**< xbar input 27, PWMA3_MUX_TRIG1. */
    kSIM_XbarIn27PWMB3OutTrig1      = 1U,          /**< xbar input 27, PWMB3_OUT_TRIG1. */
    kSIM_XbarIn28PWMB0MuxTrig0      = 0U,          /**< xbar input 28, PWMB0_MUX_TRIG0. */
    kSIM_XbarIn28PWMA0OutTrig0      = 1U,          /**< xbar input 28, PWMA0_OUT_TRIG0. */
    kSIM_XbarIn29PWMB0MuxTrig1      = 0U,          /**< xbar input 29, PWMB0_MUX_TRIG1. */
    kSIM_XbarIn29PWMA0OutTrig1      = 1U,          /**< xbar input 29, PWMA0_OUT_TRIG1. */
    kSIM_XbarIn30PWMB1MuxTrig0      = 0U,          /**< xbar input 30, PWMB1_MUX_TRIG0. */
    kSIM_XbarIn30PWMA1OutTrig0      = 1U,          /**< xbar input 30, PWMA1_OUT_TRIG0. */
    kSIM_XbarIn31PWMB1MuxTrig1      = 0U,          /**< xbar input 31, PWMB1_MUX_TRIG1. */
    kSIM_XbarIn31PWMA1OutTrig1      = 1U,          /**< xbar input 31, PWMA1_OUT_TRIG1. */
    kSIM_XbarIn32PWMB2MuxTrig0      = 0U,          /**< xbar input 32, PWMB2_MUX_TRIG0. */
    kSIM_XbarIn32PWMA2OutTrig0      = 1U,          /**< xbar input 32, PWMA2_OUT_TRIG0. */
    kSIM_XbarIn33PWMB2MuxTrig1      = 0U,          /**< xbar input 33, PWMB2_MUX_TRIG1. */
    kSIM_XbarIn33PWMA2OutTrig1      = 1U,          /**< xbar input 33, PWMA2_OUT_TRIG1. */
    kSIM_XbarIn34PWMB3MuxTrig0      = 0U,          /**< xbar input 34, PWMB3_MUX_TRIG0. */
    kSIM_XbarIn34PWMA3OutTrig0      = 1U,          /**< xbar input 34, PWMA3_OUT_TRIG0. */
    kSIM_XbarIn35PWMB3MuxTrig1      = 0U,          /**< xbar input 35, PWMB3_MUX_TRIG1. */
    kSIM_XbarIn35PWMA3OutTrig1      = 1U,          /**< xbar input 35, PWMA3_OUT_TRIG1. */
} sim_xbar_input_pwm_selection_t;
#endif /* SIM_XBAR_INPUT_PWM_SELECTION_T_ */

#if !defined(SIM_XBAR_INPUT_ADC_TMR_INDEX_T_)
#define SIM_XBAR_INPUT_ADC_TMR_INDEX_T_
typedef enum _sim_xbar_input_adc_tmr_index
{
    kSIM_XBARIN36Index              = 0U,          /**< xbar input 36. */
    kSIM_XBARIN37Index              = 1U,          /**< xbar input 37. */
    kSIM_XBARIN38Index              = 2U,          /**< xbar input 38. */
    kSIM_XBARIN39Index              = 3U,          /**< xbar input 39. */
    kSIM_XBARIN16Index              = 8U,          /**< xbar input 16. */
    kSIM_XBARIN17Index              = 9U,          /**< xbar input 17. */
    kSIM_XBARIN18Index              = 10U,         /**< xbar input 18. */
    kSIM_XBARIN19Index              = 11U,         /**< xbar input 19. */
} sim_xbar_input_adc_tmr_index_t;
