zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/DSC/MC56F83xxx/periph/PERI_SIM.h
#endif /* SIM_XBAR_INPUT_ADC_TMR_INDEX_T_ */

#if !defined(SIM_XBAR_INPUT_ADC_TMR_SELECTION_T_)
#define SIM_XBAR_INPUT_ADC_TMR_SELECTION_T_
typedef enum _sim_xbar_input_adc_tmr_selection
{
    kSIM_XBARIN36TMRA0              = 0U,          /**< xbar input 36, TMRA0. */
    kSIM_XBARIN36ADCAN0limit        = 1U,          /**< xbar input 36, ADC AN0 limit. */
    kSIM_XBARIN37TMRA1              = 0U,          /**< xbar input 37, TMRA1. */
    kSIM_XBARIN37ADCAN1limit        = 1U,          /**< xbar input 37, ADC AN1 limit. */
    kSIM_XBARIN38TMRA2              = 0U,          /**< xbar input 38, TMRA2. */
    kSIM_XBARIN38ADCAN2limit        = 1U,          /**< xbar input 38, ADC AN2 limit. */
    kSIM_XBARIN39TMRA3              = 0U,          /**< xbar input 39, TMRA3. */
    kSIM_XBARIN39ADCAN3limit        = 1U,          /**< xbar input 39, ADC AN3 limit. */
    kSIM_XBARIN16TMRB0              = 0U,          /**< xbar input 16, TMRB0. */
    kSIM_XBARIN16ADCAN8limit        = 1U,          /**< xbar input 16, ADC AN8 limit. */
    kSIM_XBARIN17TMRB1              = 0U,          /**< xbar input 17, TMRB1. */
    kSIM_XBARIN17ADCAN9limit        = 1U,          /**< xbar input 17, ADC AN9 limit. */
    kSIM_XBARIN18TMRB2              = 0U,          /**< xbar input 18, TMRB2. */
    kSIM_XBARIN18ADCAN10limit       = 1U,          /**< xbar input 18, ADC AN10 limit. */
    kSIM_XBARIN19TMRB3              = 0U,          /**< xbar input 19, TMRB3. */
    kSIM_XBARIN19ADCAN11limit       = 1U,          /**< xbar input 19, ADC AN11 limit. */
} sim_xbar_input_adc_tmr_selection_t;
#endif /* SIM_XBAR_INPUT_ADC_TMR_SELECTION_T_ */

#if !defined(SIM_SWRESET_PERI_INDEX_T_)
#define SIM_SWRESET_PERI_INDEX_T_
typedef enum _sim_swReset_peri_index
{
    kSIM_SWResetGPIO                = 6U,          /**< GPIO Software Reset. */
    kSIM_SWResetTMRB                = 11U,         /**< TMRB Software Reset. */
    kSIM_SWResetTMRA                = 15U,         /**< TMRA Software Reset. */
    kSIM_SWResetFLEXCAN             = 16U,         /**< FlexCAN Software Reset. */
    kSIM_SWResetIIC1                = 21U,         /**< IIC1 Software Reset. */
    kSIM_SWResetIIC0                = 22U,         /**< IIC0 Software Reset. */
    kSIM_SWResetQSPI1               = 24U,         /**< QSPI1 Software Reset. */
    kSIM_SWResetQSPI0               = 25U,         /**< QSPI0 Software Reset. */
    kSIM_SWResetSCI2                = 26U,         /**< SCI2 Software Reset. */
    kSIM_SWResetSCI1                = 27U,         /**< SCI1 Software Reset. */
    kSIM_SWResetSCI0                = 28U,         /**< SCI0 Software Reset. */
    kSIM_SWResetDACA                = 29U,         /**< DACA Software Reset. */
    kSIM_SWResetDACB                = 30U,         /**< DACB Software Reset. */
    kSIM_SWResetPIT1                = 34U,         /**< PIT1 Software Reset. */
    kSIM_SWResetPIT0                = 35U,         /**< PIT0 Software Reset. */
    kSIM_SWResetCRC                 = 37U,         /**< CRC Software Reset. */
    kSIM_SWResetCADC                = 39U,         /**< Cyclic ADC Software Reset. */
    kSIM_SWResetCMP                 = 44U,         /**< CMP Software Reset. */
    kSIM_SWResetEWM                 = 47U,         /**< EWM Software Reset. */
    kSIM_SWResetPWMB                = 51U,         /**< PWMB Software Reset. */
    kSIM_SWResetPWMA                = 55U,         /**< PWMA Software Reset. */
    kSIM_SWResetUSBOTG              = 56U,         /**< USB_OTG Software Reset. */
    kSIM_SWResetDMAMUX              = 57U,         /**< DMA_MUX Software Reset. */
} sim_swReset_peri_index_t;
#endif /* SIM_SWRESET_PERI_INDEX_T_ */

#if !defined(SIM_INTERNAL_PERI_INDEX_T_)
#define SIM_INTERNAL_PERI_INDEX_T_
typedef enum _sim_internal_peri_index
{
    kSIM_PWMAFault0InputIndex       = 0U,          /**< Select PWMA Fault 0 Input. */
    kSIM_PWMAFault1InputIndex       = 1U,          /**< Select PWMA Fault 1 Input. */
    kSIM_PWMAFault2InputIndex       = 2U,          /**< Select PWMA Fault 2 Input. */
    kSIM_PWMAFault3InputIndex       = 3U,          /**< Select PWMA Fault 3 Input. */
    kSIM_PWMBFault0InputIndex       = 4U,          /**< Select PWMB Fault 0 Input. */
    kSIM_PWMBFault1InputIndex       = 5U,          /**< Select PWMB Fault 1 Input. */
    kSIM_PWMBFault2InputIndex       = 6U,          /**< Select PWMB Fault 2 Input. */
    kSIM_TMRA0InputIndex            = 8U,          /**< Select TMRA0 Input. */
    kSIM_TMRA1InputIndex            = 9U,          /**< Select TMRA1 Input. */
    kSIM_TMRA2InputIndex            = 10U,         /**< Select TMRA2 Input. */
    kSIM_TMRA3InputIndex            = 11U,         /**< Select TMRA3 Input. */
    kSIM_TMRB0InputIndex            = 12U,         /**< Select TMRB0 Input. */
    kSIM_TMRB1InputIndex            = 13U,         /**< Select TMRB1 Input. */
    kSIM_TMRB2InputIndex            = 14U,         /**< Select TMRB2 Input. */
    kSIM_TMRB3InputIndex            = 15U,         /**< Select TMRB3 Input. */
} sim_internal_peri_index_t;
#endif /* SIM_INTERNAL_PERI_INDEX_T_ */

#if !defined(SIM_INTERNAL_PERI_INPUT_T_)
#define SIM_INTERNAL_PERI_INPUT_T_
typedef enum _sim_internal_peri_input
{
    kSIM_PWMAFault0Input_GPIOE8     = 0U,          /**< Select PWMA Fault 0 Input, GPIOE8. */
    kSIM_PWMAFault0Input_XB_OUT29   = 1U,          /**< Select PWMA Fault 0 Input, XB_OUT29. */
    kSIM_PWMAFault1Input_GPIOE9     = 0U,          /**< Select PWMA Fault 1 Input, GPIOE9. */
    kSIM_PWMAFault1Input_XB_OUT30   = 1U,          /**< Select PWMA Fault 1 Input, XB_OUT30. */
    kSIM_PWMAFault2Input_GPIOG4     = 0U,          /**< Select PWMA Fault 2 Input, GPIOG4. */
    kSIM_PWMAFault2Input_XB_OUT31   = 1U,          /**< Select PWMA Fault 2 Input, XB_OUT31. */
    kSIM_PWMAFault3Input_GPIOG5     = 0U,          /**< Select PWMA Fault 3 Input, GPIOG5. */
    kSIM_PWMAFault3Input_XB_OUT32   = 1U,          /**< Select PWMA Fault 3 Input, XB_OUT32. */
    kSIM_PWMBFault0Input_GPIOF14    = 0U,          /**< Select PWMB Fault 0 Input, GPIOF14. */
    kSIM_PWMBFault0Input_XB_OUT29   = 1U,          /**< Select PWMB Fault 0 Input, XB_OUT29. */
    kSIM_PWMBFault1Input_GPIOF13    = 0U,          /**< Select PWMB Fault 1 Input, GPIOF13. */
    kSIM_PWMBFault1Input_XB_OUT30   = 1U,          /**< Select PWMB Fault 1 Input, XB_OUT30. */
    kSIM_PWMBFault2Input_GPIOF12    = 0U,          /**< Select PWMB Fault 2 Input, GPIOF12. */
    kSIM_PWMBFault2Input_XB_OUT31   = 1U,          /**< Select PWMB Fault 2 Input, XB_OUT31. */
    kSIM_TMRA0Input_GPIOC3          = 0U,          /**< Select TMRA0 Input, GPIOC3. */
    kSIM_TMRA0Input_XB_OUT38        = 1U,          /**< Select TMRA0 Input, XB_OUT38. */
    kSIM_TMRA1Input_GPIOC4          = 0U,          /**< Select TMRA1 Input, GPIOC4. */
    kSIM_TMRA1Input_XB_OUT39        = 1U,          /**< Select TMRA1 Input, XB_OUT39. */
    kSIM_TMRA2Input_GPIOC6_GPIOG8   = 0U,          /**< Select TMRA2 Input, GPIOC6 or GPIOG8. */
    kSIM_TMRA2Input_XB_OUT40        = 1U,          /**< Select TMRA2 Input, XB_OUT40. */
    kSIM_TMRA3Input_GPIOC13_GPIOG9  = 0U,          /**< Select TMRA3 Input, GPIOC13 or GPIOG9. */
    kSIM_TMRA3Input_XB_OUT41        = 1U,          /**< Select TMRA3 Input, XB_OUT41. */
    kSIM_TMRB0Input_GPIOC2          = 0U,          /**< Select TMRB0 Input, GPIOC2. */
    kSIM_TMRB0Input_XB_OUT34        = 1U,          /**< Select TMRB0 Input, XB_OUT34. */
    kSIM_TMRB1Input_GPIOF8          = 0U,          /**< Select TMRB1 Input, GPIOF8. */
    kSIM_TMRB1Input_XB_OUT35        = 1U,          /**< Select TMRB1 Input, XB_OUT35. */
    kSIM_TMRB2Input_GPIOF6_GPIOF0_GPIOG6 = 0U,     /**< Select TMRB2 Input, GPIOF6, GPIOF0, or GPIOG6. */
    kSIM_TMRB2Input_XB_OUT36        = 1U,          /**< Select TMRB2 Input, XB_OUT36. */
    kSIM_TMRB3Input_GPIOF7_GPIOG11  = 0U,          /**< Select TMRB3 Input, GPIOF7 or GPIOG11. */
    kSIM_TMRB3Input_XB_OUT37        = 1U,          /**< Select TMRB3 Input, XB_OUT37. */
} sim_internal_peri_input_t;
#endif /* SIM_INTERNAL_PERI_INPUT_T_ */

#if !defined(SIM_SOFTWARE_CONTRL_REGISTER_INDEX_T_)
#define SIM_SOFTWARE_CONTRL_REGISTER_INDEX_T_
typedef enum _sim_software_contrl_register_index
{
    kSIM_SCR0                       = 0U,          /**< SCR0. */
    kSIM_SCR1                       = 1U,          /**< SCR1. */
    kSIM_SCR2                       = 2U,          /**< SCR2. */
    kSIM_SCR3                       = 3U,          /**< SCR3. */
    kSIM_SCR4                       = 4U,          /**< SCR4. */
    kSIM_SCR5                       = 5U,          /**< SCR5. */
    kSIM_SCR6                       = 6U,          /**< SCR6. */
    kSIM_SCR7                       = 7U,          /**< SCR7. */
} sim_software_contrl_register_index_t;
