zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/DSC/MC56F83xxx/periph/PERI_SIM.h
#endif /* SIM_SOFTWARE_CONTRL_REGISTER_INDEX_T_ */

#if !defined(SIM_BOOT_OVERRIDE_MODE_T_)
#define SIM_BOOT_OVERRIDE_MODE_T_
/*!
 * @brief The enumeration of boot over ride mode, FOPT[7:6] & ~ boot_override_mode determines the boot option,
 * the result 11b boots from ROM, while any other values boot from flash.
 */
typedef enum _sim_boot_override_mode
{
    kSIM_BootFromRomOrFlash         = 0U,          /**< Boot from ROM or Flash depending on FOPT[7:6] at next non-POR reset. */
    kSIM_BootFromFlash              = 1U,          /**< Boot from flash at next non-POR reset. */
} sim_boot_override_mode_t;
#endif /* SIM_BOOT_OVERRIDE_MODE_T_ */


/*!
 * @}
 */ /* end of group Mapping_Information */


/* ----------------------------------------------------------------------------
   -- Device Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Peripheral_access_layer Device Peripheral Access Layer
 * @{
 */


/*
** Start of section using anonymous unions
*/

#if defined(__CWCC__)
  #pragma push
  #pragma cpp_extensions on
#else
  #error Not supported compiler type
#endif

/* ----------------------------------------------------------------------------
   -- SIM Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SIM_Peripheral_Access_Layer SIM Peripheral Access Layer
 * @{
 */

/** SIM - Register Layout Typedef */
typedef struct {
  __IO uint16_t CTRL;                              /**< Control Register, offset: 0x0 */
  __I  uint16_t RSTAT;                             /**< Reset Status Register, offset: 0x1 */
  __IO uint16_t SCR0;                              /**< Software Control Register, offset: 0x2 */
  __IO uint16_t SCR1;                              /**< Software Control Register, offset: 0x3 */
  __IO uint16_t SCR2;                              /**< Software Control Register, offset: 0x4 */
  __IO uint16_t SCR3;                              /**< Software Control Register, offset: 0x5 */
       uint16_t MSHID;                             /**< Most Significant Half of JTAG ID, offset: 0x6 */
       uint16_t LSHID;                             /**< Least Significant Half of JTAG ID, offset: 0x7 */
  __IO uint16_t PWR;                               /**< Power Control Register, offset: 0x8 */
       uint16_t RESERVED_0[1];
  __IO uint16_t CLKOUT;                            /**< Clock Output Select Register, offset: 0xA */
  __IO uint16_t PCR;                               /**< Peripheral Clock Rate Register, offset: 0xB */
  __IO uint16_t PCE0;                              /**< Peripheral Clock Enable Register 0, offset: 0xC */
  __IO uint16_t PCE1;                              /**< Peripheral Clock Enable Register 1, offset: 0xD */
  __IO uint16_t PCE2;                              /**< Peripheral Clock Enable Register 2, offset: 0xE */
  __IO uint16_t PCE3;                              /**< Peripheral Clock Enable Register 3, offset: 0xF */
  __IO uint16_t SD0;                               /**< Peripheral Clock STOP Disable Register 0, offset: 0x10 */
  __IO uint16_t SD1;                               /**< Peripheral Clock STOP Disable Register 1, offset: 0x11 */
  __IO uint16_t SD2;                               /**< Peripheral Clock STOP Disable Register 2, offset: 0x12 */
  __IO uint16_t SD3;                               /**< Peripheral Clock STOP Disable Register 3, offset: 0x13 */
  __IO uint16_t IOSAHI;                            /**< I/O Short Address Location Register, offset: 0x14 */
  __IO uint16_t IOSALO;                            /**< I/O Short Address Location Register, offset: 0x15 */
  __IO uint16_t PROT;                              /**< Protection Register, offset: 0x16 */
  __IO uint16_t GPSAL;                             /**< GPIOA LSBs Peripheral Select Register, offset: 0x17 */
  __IO uint16_t GPSAH;                             /**< GPIOA MSBs Peripheral Select Register, offset: 0x18 */
  __IO uint16_t GPSBL;                             /**< GPIOB LSBs Peripheral Select Register, offset: 0x19 */
  __IO uint16_t GPSBH;                             /**< GPIOB MSBs Peripheral Select Register, offset: 0x1A */
  __IO uint16_t GPSCL;                             /**< GPIOC LSBs Peripheral Select Register, offset: 0x1B */
  __IO uint16_t GPSCH;                             /**< GPIOC MSBs Peripheral Select Register, offset: 0x1C */
  __IO uint16_t GPSDL;                             /**< GPIOD LSBs Peripheral Select Register, offset: 0x1D */
       uint16_t RESERVED_1[1];
  __IO uint16_t GPSEL;                             /**< GPIOE LSBs Peripheral Select Register, offset: 0x1F */
  __IO uint16_t GPSEH;                             /**< GPIOE MSBs Peripheral Select Register, offset: 0x20 */
  __IO uint16_t GPSFL;                             /**< GPIOF LSBs Peripheral Select Register, offset: 0x21 */
  __IO uint16_t GPSFH;                             /**< GPIOF MSBs Peripheral Select Register, offset: 0x22 */
  __IO uint16_t GPSGL;                             /**< GPIOG LSBs Peripheral Select Register, offset: 0x23 */
  __IO uint16_t GPSGH;                             /**< GPIOG MSBs Peripheral Select Register, offset: 0x24 */
       uint16_t RESERVED_2[4];
  __IO uint16_t IPS0;                              /**< Internal Peripheral Select Register 0, offset: 0x29 */
  __IO uint16_t MISC0;                             /**< Miscellaneous Register 0, offset: 0x2A */
  __IO uint16_t PSWR0;                             /**< Peripheral Software Reset Register 0, offset: 0x2B */
  __IO uint16_t PSWR1;                             /**< Peripheral Software Reset Register 1, offset: 0x2C */
  __IO uint16_t PSWR2;                             /**< Peripheral Software Reset Register 2, offset: 0x2D */
  __IO uint16_t PSWR3;                             /**< Peripheral Software Reset Register 3, offset: 0x2E */
  __IO uint16_t PWRMODE;                           /**< Power Mode Register, offset: 0x2F */
       uint16_t RESERVED_3[12];
  __I  uint16_t NVMOPT6_LOW;                       /**< Non-Volatile Memory Option Register 6 (Low), offset: 0x3C */
       uint16_t RESERVED_4[15];
  __IO uint16_t PWM_SEL;                           /**< PWM Select Register, offset: 0x4C */
  __IO uint16_t ADC_TMR_SEL;                       /**< ADC and TMR Select Register, offset: 0x4D */
  __IO uint16_t BOOT_MODE_OVERRIDE;                /**< Boot Mode Override Register, offset: 0x4E */
  __IO uint16_t SCR4;                              /**< Software Control Register, offset: 0x4F */
  __IO uint16_t SCR5;                              /**< Software Control Register, offset: 0x50 */
  __IO uint16_t SCR6;                              /**< Software Control Register, offset: 0x51 */
  __IO uint16_t SCR7;                              /**< Software Control Register, offset: 0x52 */
} SIM_Type;

/* ----------------------------------------------------------------------------
   -- SIM Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SIM_Register_Masks SIM Register Masks
 * @{
 */

