zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/DSC/MC56F83xxx/periph/PERI_SIM.h
#define SIM_NVMOPT6_LOW_PMC_BGTRIM_MASK          (0xF000U)
#define SIM_NVMOPT6_LOW_PMC_BGTRIM_SHIFT         (12U)
#define SIM_NVMOPT6_LOW_PMC_BGTRIM(x)            (((uint16_t)(((uint16_t)(x)) << SIM_NVMOPT6_LOW_PMC_BGTRIM_SHIFT)) & SIM_NVMOPT6_LOW_PMC_BGTRIM_MASK)
/*! @} */

/*! @name PWM_SEL - PWM Select Register */
/*! @{ */

#define SIM_PWM_SEL_XBAR_IN20_MASK               (0x1U)
#define SIM_PWM_SEL_XBAR_IN20_SHIFT              (0U)
/*! XBAR_IN20
 *  0b0..PWMA0_MUX_TRIG0
 *  0b1..PWMB0_OUT_TRIG0
 */
#define SIM_PWM_SEL_XBAR_IN20(x)                 (((uint16_t)(((uint16_t)(x)) << SIM_PWM_SEL_XBAR_IN20_SHIFT)) & SIM_PWM_SEL_XBAR_IN20_MASK)

#define SIM_PWM_SEL_XBAR_IN21_MASK               (0x2U)
#define SIM_PWM_SEL_XBAR_IN21_SHIFT              (1U)
/*! XBAR_IN21
 *  0b0..PWMA0_MUX_TRIG1
 *  0b1..PWMB0_OUT_TRIG1
 */
#define SIM_PWM_SEL_XBAR_IN21(x)                 (((uint16_t)(((uint16_t)(x)) << SIM_PWM_SEL_XBAR_IN21_SHIFT)) & SIM_PWM_SEL_XBAR_IN21_MASK)

#define SIM_PWM_SEL_XBAR_IN22_MASK               (0x4U)
#define SIM_PWM_SEL_XBAR_IN22_SHIFT              (2U)
/*! XBAR_IN22
 *  0b0..PWMA1_MUX_TRIG0
 *  0b1..PWMB1_OUT_TRIG0
 */
#define SIM_PWM_SEL_XBAR_IN22(x)                 (((uint16_t)(((uint16_t)(x)) << SIM_PWM_SEL_XBAR_IN22_SHIFT)) & SIM_PWM_SEL_XBAR_IN22_MASK)

#define SIM_PWM_SEL_XBAR_IN23_MASK               (0x8U)
#define SIM_PWM_SEL_XBAR_IN23_SHIFT              (3U)
/*! XBAR_IN23
 *  0b0..PWMA1_MUX_TRIG1
 *  0b1..PWMB1_OUT_TRIG1
 */
#define SIM_PWM_SEL_XBAR_IN23(x)                 (((uint16_t)(((uint16_t)(x)) << SIM_PWM_SEL_XBAR_IN23_SHIFT)) & SIM_PWM_SEL_XBAR_IN23_MASK)

#define SIM_PWM_SEL_XBAR_IN24_MASK               (0x10U)
#define SIM_PWM_SEL_XBAR_IN24_SHIFT              (4U)
/*! XBAR_IN24
 *  0b0..PWMA2_MUX_TRIG0
 *  0b1..PWMB2_OUT_TRIG0
 */
#define SIM_PWM_SEL_XBAR_IN24(x)                 (((uint16_t)(((uint16_t)(x)) << SIM_PWM_SEL_XBAR_IN24_SHIFT)) & SIM_PWM_SEL_XBAR_IN24_MASK)

#define SIM_PWM_SEL_XBAR_IN25_MASK               (0x20U)
#define SIM_PWM_SEL_XBAR_IN25_SHIFT              (5U)
/*! XBAR_IN25
 *  0b0..PWMA2_MUX_TRIG1
 *  0b1..PWMB2_OUT_TRIG1
 */
#define SIM_PWM_SEL_XBAR_IN25(x)                 (((uint16_t)(((uint16_t)(x)) << SIM_PWM_SEL_XBAR_IN25_SHIFT)) & SIM_PWM_SEL_XBAR_IN25_MASK)

#define SIM_PWM_SEL_XBAR_IN26_MASK               (0x40U)
#define SIM_PWM_SEL_XBAR_IN26_SHIFT              (6U)
/*! XBAR_IN26
 *  0b0..PWMA3_MUX_TRIG0
 *  0b1..PWMB3_OUT_TRIG0
 */
#define SIM_PWM_SEL_XBAR_IN26(x)                 (((uint16_t)(((uint16_t)(x)) << SIM_PWM_SEL_XBAR_IN26_SHIFT)) & SIM_PWM_SEL_XBAR_IN26_MASK)

#define SIM_PWM_SEL_XBAR_IN27_MASK               (0x80U)
#define SIM_PWM_SEL_XBAR_IN27_SHIFT              (7U)
/*! XBAR_IN27
 *  0b0..PWMA3_MUX_TRIG1
 *  0b1..PWMB3_OUT_TRIG1
 */
#define SIM_PWM_SEL_XBAR_IN27(x)                 (((uint16_t)(((uint16_t)(x)) << SIM_PWM_SEL_XBAR_IN27_SHIFT)) & SIM_PWM_SEL_XBAR_IN27_MASK)

#define SIM_PWM_SEL_XBAR_IN28_MASK               (0x100U)
#define SIM_PWM_SEL_XBAR_IN28_SHIFT              (8U)
/*! XBAR_IN28
 *  0b0..PWMB0_MUX_TRIG0
 *  0b1..PWMA0_OUT_TRIG0
 */
#define SIM_PWM_SEL_XBAR_IN28(x)                 (((uint16_t)(((uint16_t)(x)) << SIM_PWM_SEL_XBAR_IN28_SHIFT)) & SIM_PWM_SEL_XBAR_IN28_MASK)

#define SIM_PWM_SEL_XBAR_IN29_MASK               (0x200U)
#define SIM_PWM_SEL_XBAR_IN29_SHIFT              (9U)
/*! XBAR_IN29
 *  0b0..PWMB0_MUX_TRIG1
 *  0b1..PWMA0_OUT_TRIG1
 */
#define SIM_PWM_SEL_XBAR_IN29(x)                 (((uint16_t)(((uint16_t)(x)) << SIM_PWM_SEL_XBAR_IN29_SHIFT)) & SIM_PWM_SEL_XBAR_IN29_MASK)

#define SIM_PWM_SEL_XBAR_IN30_MASK               (0x400U)
#define SIM_PWM_SEL_XBAR_IN30_SHIFT              (10U)
/*! XBAR_IN30
 *  0b0..PWMB1_MUX_TRIG0
 *  0b1..PWMA1_OUT_TRIG0
 */
#define SIM_PWM_SEL_XBAR_IN30(x)                 (((uint16_t)(((uint16_t)(x)) << SIM_PWM_SEL_XBAR_IN30_SHIFT)) & SIM_PWM_SEL_XBAR_IN30_MASK)

#define SIM_PWM_SEL_XBAR_IN31_MASK               (0x800U)
#define SIM_PWM_SEL_XBAR_IN31_SHIFT              (11U)
/*! XBAR_IN31
 *  0b0..PWMB1_MUX_TRIG1
 *  0b1..PWMA1_OUT_TRIG1
 */
#define SIM_PWM_SEL_XBAR_IN31(x)                 (((uint16_t)(((uint16_t)(x)) << SIM_PWM_SEL_XBAR_IN31_SHIFT)) & SIM_PWM_SEL_XBAR_IN31_MASK)

#define SIM_PWM_SEL_XBAR_IN32_MASK               (0x1000U)
#define SIM_PWM_SEL_XBAR_IN32_SHIFT              (12U)
/*! XBAR_IN32
 *  0b0..PWMB2_MUX_TRIG0
 *  0b1..PWMA2_OUT_TRIG0
 */
#define SIM_PWM_SEL_XBAR_IN32(x)                 (((uint16_t)(((uint16_t)(x)) << SIM_PWM_SEL_XBAR_IN32_SHIFT)) & SIM_PWM_SEL_XBAR_IN32_MASK)

#define SIM_PWM_SEL_XBAR_IN33_MASK               (0x2000U)
#define SIM_PWM_SEL_XBAR_IN33_SHIFT              (13U)
/*! XBAR_IN33
 *  0b0..PWMB2_MUX_TRIG1
 *  0b1..PWMA2_OUT_TRIG1
 */
#define SIM_PWM_SEL_XBAR_IN33(x)                 (((uint16_t)(((uint16_t)(x)) << SIM_PWM_SEL_XBAR_IN33_SHIFT)) & SIM_PWM_SEL_XBAR_IN33_MASK)

#define SIM_PWM_SEL_XBAR_IN34_MASK               (0x4000U)
#define SIM_PWM_SEL_XBAR_IN34_SHIFT              (14U)
/*! XBAR_IN34
 *  0b0..PWMB3_MUX_TRIG0
 *  0b1..PWMA3_OUT_TRIG0
 */
#define SIM_PWM_SEL_XBAR_IN34(x)                 (((uint16_t)(((uint16_t)(x)) << SIM_PWM_SEL_XBAR_IN34_SHIFT)) & SIM_PWM_SEL_XBAR_IN34_MASK)

#define SIM_PWM_SEL_XBAR_IN35_MASK               (0x8000U)
#define SIM_PWM_SEL_XBAR_IN35_SHIFT              (15U)
/*! XBAR_IN35
 *  0b0..PWMB3_MUX_TRIG1
 *  0b1..PWMA3_OUT_TRIG1
 */
#define SIM_PWM_SEL_XBAR_IN35(x)                 (((uint16_t)(((uint16_t)(x)) << SIM_PWM_SEL_XBAR_IN35_SHIFT)) & SIM_PWM_SEL_XBAR_IN35_MASK)
/*! @} */

/*! @name ADC_TMR_SEL - ADC and TMR Select Register */
/*! @{ */

#define SIM_ADC_TMR_SEL_XBAR_IN36_MASK           (0x1U)
#define SIM_ADC_TMR_SEL_XBAR_IN36_SHIFT          (0U)
/*! XBAR_IN36
 *  0b0..TMRA0
 *  0b1..ADC AN0 limit
 */
#define SIM_ADC_TMR_SEL_XBAR_IN36(x)             (((uint16_t)(((uint16_t)(x)) << SIM_ADC_TMR_SEL_XBAR_IN36_SHIFT)) & SIM_ADC_TMR_SEL_XBAR_IN36_MASK)

#define SIM_ADC_TMR_SEL_XBAR_IN37_MASK           (0x2U)
#define SIM_ADC_TMR_SEL_XBAR_IN37_SHIFT          (1U)
/*! XBAR_IN37
 *  0b0..TMRA1
 *  0b1..ADC AN1 limit
 */
#define SIM_ADC_TMR_SEL_XBAR_IN37(x)             (((uint16_t)(((uint16_t)(x)) << SIM_ADC_TMR_SEL_XBAR_IN37_SHIFT)) & SIM_ADC_TMR_SEL_XBAR_IN37_MASK)

#define SIM_ADC_TMR_SEL_XBAR_IN38_MASK           (0x4U)
#define SIM_ADC_TMR_SEL_XBAR_IN38_SHIFT          (2U)
/*! XBAR_IN38
 *  0b0..TMRA2
 *  0b1..ADC AN2 limit
 */
#define SIM_ADC_TMR_SEL_XBAR_IN38(x)             (((uint16_t)(((uint16_t)(x)) << SIM_ADC_TMR_SEL_XBAR_IN38_SHIFT)) & SIM_ADC_TMR_SEL_XBAR_IN38_MASK)

#define SIM_ADC_TMR_SEL_XBAR_IN39_MASK           (0x8U)
#define SIM_ADC_TMR_SEL_XBAR_IN39_SHIFT          (3U)
/*! XBAR_IN39
 *  0b0..TMRA3
 *  0b1..ADC AN3 limit
 */
#define SIM_ADC_TMR_SEL_XBAR_IN39(x)             (((uint16_t)(((uint16_t)(x)) << SIM_ADC_TMR_SEL_XBAR_IN39_SHIFT)) & SIM_ADC_TMR_SEL_XBAR_IN39_MASK)

#define SIM_ADC_TMR_SEL_XBAR_IN16_MASK           (0x100U)
#define SIM_ADC_TMR_SEL_XBAR_IN16_SHIFT          (8U)
/*! XBAR_IN16
 *  0b0..TMRB0
 *  0b1..ADC AN8 limit
 */
#define SIM_ADC_TMR_SEL_XBAR_IN16(x)             (((uint16_t)(((uint16_t)(x)) << SIM_ADC_TMR_SEL_XBAR_IN16_SHIFT)) & SIM_ADC_TMR_SEL_XBAR_IN16_MASK)

